var words = [
    "愿你遇良人，予你欢喜城",
    "你是我千种诗意万种想象",
    "想做一个很酷的人扭头就走 比你酷比你狠",
    "对不起，也许我将要打扰你，打扰你一生，而不是一下",
    "愿你有所爱有所期待.",
    "世事如书，我偏爱你这一句，愿做个逗号，待在你脚边。但你有自己的朗读者，而我只是个摆渡人.",
    "处事不必求功，无过便是功；为人不必感德，无怨便是德。",
    "当你知道迷惑时，并不可怜，当你不知道迷惑时，才是最可怜的。",
    "相爱容易,因为五官。相处不易， 因为三观。",
    "你不能对所有人善良 但 善良真的很重要",
    "我始终相信读过的所有书都不会白读，它总会在未来日子的某一个场合， 帮助我表现得更出色。",
    "别在该拼搏的年纪选择转发锦鲤",
    "愿你我永远年轻 永远热泪盈眶",
    "路的尽头，仍然是路，只要你愿意走。",
    "使我们不快乐的，都一些芝麻小事，我们可以闪躲一头大象，却躲不开一只苍蝇。",
    "一万个美丽的未来，抵不上一个温暖的现在。",
    "只有回不去的，没有过不去的。",
    "状态是干出来的，而不是等出来的。",
    "在敌人面前，谁先镇定下来，谁就离胜利不远了。",
    "人生若只如初见，何事秋风悲画扇。",
    "相思相见知何日？此时此夜难为情。",
    "这次我离开你，是风，是雨，是夜晚；你笑了笑，我摆一摆手，一条寂寞的路便展向两头了。",
    "曾经沧海难为水，除却巫山不是云。",
    "如何让你遇见我，在我最美丽的时刻。"
];

var _hmt = _hmt || [];
(function() {
    var hm = document.createElement("script");
    hm.src = "https://hm.baidu.com/hm.js?4cba0cf9c055e2a3aa6dd24cb418c43a";
    var s = document.getElementsByTagName("script")[0];
    s.parentNode.insertBefore(hm, s);
})();

(function(){
    var rand = parseInt(Math.random() * words.length);
    document.getElementById("subt").innerHTML = words[rand];
    console.log(rand+"\n");
})();

(function (){
    setInterval(
        function () {
            $("#subt").fadeOut(1000);
            $("#subt").fadeIn(1000)
        },
        3000
    );
})();
